//создаем крут модель
let boxShadow = '';
for (let i = 0; i <= 2000; i++) {
    px = (Math.random() < 0.5) ? '-' : '';
    py = (Math.random() < 0.5) ? "-" : "";
    x = Math.floor((Math.random() * window.innerWidth) + 1);
    y = Math.floor((Math.random() * window.innerHeight) + 1);
    s = Math.floor((Math.random() * 2) - 1);

    boxShadow += px + x + "px"
        + py + y + "px 0" + s + "px #fff,";
}
boxShadow = boxShadow.slice(0, -1);
stars.style.boxShadow = boxShadow;
//==================================================================================
let price = document.querySelector('#container div:last-child')
let boxPrice = document.querySelectorAll('#container div img')
for (let i = 0; i < boxPrice.length; i++) {
    console.log(boxPrice[i].src)
    boxPrice[i].onclick = function () {
        price.style.fontSize = `30px`;
        if (boxPrice[i].src === "http://127.0.0.1:5500/img/grinch.png")
            price.innerHTML = `«Уходит сумасшедший 2022 год. Для кого-то он был хорошим и продуктивным,
             для кого-то негативным и сложным,Но помни новый год как у Гринча не будет ни у кого!»`
        //======================================================================================
        if (boxPrice[i].src === "http://127.0.0.1:5500/img/santa.png")
            price.innerHTML = `«Я, Санта Клаус, великий волшебник и новогодний святой –
поздравляю вас с Рождеством и Новым годом, с ёлкой,
шишками и игрушками!
С Новым годом!
С Рождеством!
С великим идущим счастьем!»`
        //======================================================================================
        if (boxPrice[i].src === "http://127.0.0.1:5500/img/snegov.png")
            price.innerHTML = `«Снеговик письмо шлет другу:
"Я тебе желаю вьюгу...
Чтоб метель весь год мела...
Льда, сугробов, снежных горок,
И морозов "минус сорок"...
И душевного тепла!"»`
        //======================================================================================
        if (boxPrice[i].src === "http://127.0.0.1:5500/img/elka.jpg")
            price.innerHTML = `«Время сквозь пальцы песком утекает,
Буднями мчатся недели, года!
Привычный уклад зимний праздник меняет,
Когда вокруг ёлки, огни, суета!
Так пусть в эти дни волшебство приключится,
Магия праздничных, радостных дней!
И сказка к вам в дверь в тот же миг постучится,
Желания ваши исполнив скорей!`
        //======================================================================================
    }
}